Revit 2027 API
AreaReinforcement.AdditionalTopCoverOffset Property
 Additional offset from the top or exterior cover reference.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AdditionalTopCoverOffset { get; set; }
Public Property AdditionalTopCoverOffset As Double
	Get
	Set
public:
property double AdditionalTopCoverOffset {
	double get ();
	void set (double value);
}
member AdditionalTopCoverOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for additionalTopCoverOffset must be no more than 30000 feet in absolute value.
See Also
Reference
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace